#-*- mode: org; -*-

**** Правила сопоставления
+ Атомы в отражении
  Каждому атому правило .... Алиасы вводятся сразу (т.е. в режиме on-line) => {a x y a} - последнее a является атомарным утверждением (т.к. первым a был введен алиас).

  | N | Элемент отражения | Соответствие | Вводимый алиас (имя) |
  |---+-------------------+--------------+----------------------|
  | 1 | '<atom>           | <atom>       |                      |
  | 2 | <atom>            | LST-сущность | <atom>               |
  | 3 | alias to <some>   | <some>       |                      |
  #+TBLFM: $1=@#-1
  где:
  <some> - LST-сущность
  <atom> - атом

  1. Цитирование атома отменяет трактовку данного атома как алиаса, и вводит атомарное утверждение:
     #+BEGIN_EXAMPLE
       alias_to_x = x

       {
         'x = a             "there is no alias introducing, because x is quoted,
                             it is not an alias, if a is not an alias to x,
                             then this line leads to compile-time error,
                             because the x and a is different attoms"

         'x = alias_to_x    "ok, atomic-assertion"
       } >> {...} 
     #+END_EXAMPLE
  2. Если атом не является алиасом (т.е. до этого не был декларирован как алиас), то он становится алиасом:
     #+BEGIN_EXAMPLE
       alias_to_x = x

       {
         x = a              "alias introducing, now x is an alias of a"
         'x = alias_to_x    "x is quoted, and therefore it is an atomic-assertion"
         x = alias_to_x     "error!"
       } >> {...}
     #+END_EXAMPLE
  3. Если атом является алиасом (т.е. до этого был декларирован как алиас), то в данной декларации этот атом трактуется не как алиас а как атомарное утверждение сущности на который данный алиас ссылается:
     #+BEGIN_EXAMPLE
       alias_to_x = x
       x = a                "alias introducing, now x is an alias of a"

       {
         x = a              "ok, atomic-asserion"     
         x = alias_to_x     "equals to 'a = x, i.e. if a is not an alias to x,
                             then this line leads to compile-time error"

         {x d} = {a 2}      "alias introducing, now d is an alias of 2,
                             x expands to 'a, and therefore it is an atomic-assertion,
                             it is equal to {'a d} = {a d}"
       } >> {...}
     #+END_EXAMPLE
+ Множества в отражении
  В Room, множество представляет из себя совокупность LST-сущностей (атомы и др. множества). В отличие от атомов, множества, несут в себе структуру. В данном случае под структурой понимется отношение порядка установленое над множеством. В Room, над любым множеством установлено отношение порядка. Следовательно, при рассматрении множества как элемента отражения, важно выделить два понятия:
  1. Содержимое множества;
  2. Отношение порядка (в дальнейшем структура множества);
  В процессе сопоставления множеств, в отражении, всегда принимает участие сопоставление _содержимого множества_ и, опционально, сопоставление _структуры множества_.
  - Сопоставление структуры множества ::
       eсли множество цитировано, то, в сопоставлении, помимо содержимого множества, также начинает играть роль и его структура.
       #+BEGIN_EXAMPLE
         '{a 'b c} = {1 2 b}   "fail, order is important - b not matches 2'

         {e 'f g} = {1 2 f}    "ok, order is not important,
                                first occurance of e introduces an alias e = 1
                                'f not matches 2, but matches third f
                                c introduces an alias c = 2"

       #+END_EXAMPLE
  - Сопоставление содержимого множества ::
       производится последовательно, слева направо, при этом, в зависимости от типа LST-сущности, применяются соответствующие правила сопоставленя отражений. Отсюда следует, что т.к. элементами множества могут служить другие множества, то процес сопоставления может нести рекурсивный характер. Касательно сопоставления атомов - при сопоставлении, введение алиасов производится сразуже помере чтения декларации отражения:
       #+BEGIN_EXAMPLE
         {a b a} = {1 2 3}    "error,
                               first occurance of a introduces alias a = 1
                               first occurance of b introduces alias b = 2
                               second occurance of a means atomic asserion 1 = 3 which is not correct"


         {e c e} = {1 2 1}    "ok"
       #+END_EXAMPLE

       | N | Элемент отражения | Соответствие              | Вводимый алиас (имя) |
       |---+-------------------+---------------------------+----------------------|
       | 1 | ...               | 0 или более LST-сущностей |                      |
       | 2 | .                 | 0 или одна LST-сущность   |                      |
       | 3 | <atom>...         | 0 или более LST-сущностей | <atom>...            |
       | 4 | <atom>.           | 0 или одна LST-сущность   | <atom>.              |
       #+TBLFM: $1=@#-1
       1. Безымянное троеточие не вводит никакой алиас в окружение. В одном отражении может встречаться не более одного безымянного троеточия:
          #+BEGIN_EXAMPLE
            {... x} = {a b (cd) a}        "ok, ... mathces a b cd sequence (not a complete set), x is an alias of a"
            {... x ...}  = {a b (cd) a}    "incorrect!"
          #+END_EXAMPLE
       2. Безымянное точка не вводит никаких алиасов в окружение.
          #+BEGIN_EXAMPLE
            {. x .} = {a b (cd)}      "ok, x is an alias of b, first . (dot) mathces a, second - (cd)"
            {. x .} = {a b}           "ok, x is an alias of b, first . (dot) mathces a, second - nothing"
            {. x} = {b}               "incorrect: dot mathces b, but x is nothing - which is imposible, because x doesn't dot-noted"
            {. x .} = {a b (cd) a}    "incorrect: last a is left unmatched"
          #+END_EXAMPLE
       3. Именованное троеточие вводит одноименный алиас в окружение. В одном отражении может встречаться не более одного имянновонного троеточия:
          #+BEGIN_EXAMPLE
            {x... y} = {a b (cd) a}          "ok, x... mathces a b cd sequence (not a copmlete set), y is an alias of a"
                some >> {x...}               "ok, equals to: some >> {a b (cd)}"
                some >> x...                 "incorrect: x... is not a complete set (i.e. it can't represent the spce)"
            {x... y z...}  = {a b (cd) a}    "incorrect: more than 2 ellipsis"
          #+END_EXAMPLE
       4. Именнованная точка вводит одноименный алиас в окружение.
          #+BEGIN_EXAMPLE
            {x. y z.} = {a b (cd)}    "ok, x. is an alias of a, y is an alias of b, z is an alias of (cd)"
            {x. y z.} = {a b}         "ok, x is an alias of b, y is an alias of b, z matches nothing"
            {x. y} = {b}              "incorrect: x. is an alias of b, but y is nothing - which is imposible, because y doesn't dot-noted"
            {x. y z.} = {a b (cd) a}  "incorrect!, last a is left unmatched"
          #+END_EXAMPLE
